import { Telegraf, Markup } from "telegraf";

// 🔐 ضع التوكن هنا
const bot = new Telegraf(process.env.BOT_TOKEN);

// تخزين حالة كل طالب
const userState = {};

// قائمة السور (نظيفة 100%)
const surahs = [
  "الفاتحة","البقرة","آل عمران","النساء","المائدة","الأنعام",
  "الأعراف","الأنفال","التوبة","يونس","هود","يوسف","الرعد",
  "إبراهيم","الحجر","النحل","الإسراء","الكهف","مريم","طه",
  "الأنبياء","الحج","المؤمنون","النور","الفرقان","الشعراء",
  "النمل","القصص","العنكبوت","الروم","لقمان","السجدة",
  "الأحزاب","سبأ","فاطر","يس","الصافات","ص","الزمر",
  "غافر","فصلت","الشورى","الزخرف","الدخان","الجاثية",
  "الأحقاف","محمد","الفتح","الحجرات","ق","الذاريات",
  "الطور","النجم","القمر","الرحمن","الواقعة","الحديد",
  "المجادلة","الحشر","الممتحنة","الصف","الجمعة","المنافقون",
  "التغابن","الطلاق","التحريم","الملك","القلم","الحاقة",
  "المعارج","نوح","الجن","المزمل","المدثر","القيامة",
  "الإنسان","المرسلات","النبأ","النازعات","عبس","التكوير",
  "الإنفطار","المطففين","الانشقاق","البروج","الطارق",
  "الأعلى","الغاشية","الفجر","البلد","الشمس","الليل",
  "الضحى","الشرح","التين","العلق","القدر","البينة",
  "الزلزلة","العاديات","القارعة","التكاثر","العصر",
  "الهمزة","الفيل","قريش","الماعون","الكوثر","الكافرون",
  "النصر",
